Documents/Renault_ЗаявкаНаКорпоративнуюСкидку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ЗаявкаНаКорпоративнуюСкидку</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КорпоративныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыЗаявокНаКорпоротивнуюСкидку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыОтгрузокНаКорпоративнуюСкидку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кузовостроитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Кузовостроители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛизинговаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЛизинговыеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияСогласованияКорпСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ИсточникДанныхЗаявкиНаКорпоративнуюСкидку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВИН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВИН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаPVC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаFlotte</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаржаПроцент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаржаСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастиеДилера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаржаПроцентRenault</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастиеRenault</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаФактура</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаPVR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентДилера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаржаДилераПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_КорпоративныеСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КорпоративныеСкидки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СкидкаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчастиеДилера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маржа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СостоянияVINВЗаявках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СостоянияVINВЗаявках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияСогласованияКорпСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ЗаявкаНаКорпоративнуюСкидку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_КартинкиИФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КартинкиИФайлы</Name>
			<Comment>Универсальный том хранилищ дополнительных данных</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Исходное имя файла для сохранения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Comment>Дата сохранения данных объекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Comment>Исходный размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к файлу / картинке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Comment>Хранилище данных картинки или файла</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВоВнешнемФайле</Name>
					<Comment>Признак того, что данные храняться во внешнем файле</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Comment>Признак того, что файл являеться картинкой</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПоЭлектроннойПочте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник) для которого необходимо реализовать хренение некоторых данных (например картинок)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификационная строка, разделяющая данные объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_ТипыЗаявокНаКорпоротивнуюСкидку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыЗаявокНаКорпоротивнуюСкидку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкидкаПриОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеСкидки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДовозмещениеСкидки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_СостоянияСогласованияКорпСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СостоянияСогласованияКорпСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПредоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетаНеБудет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПринят</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ЗаявкаНаКорпоративнуюСкидку/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Согласовать(Команда)
	
	Если Не ПроверитьПравильностьТипаЗаявки() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = ПровериитЗаполнение ();
	Если ЕстьОшибки Тогда
		Ответ = Вопрос("В документе имеются автомобили с завышенной скидкой.
		|Продолжть отправку?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да тогда
			Отказ = СогласоватьНаСервере();
		Иначе
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Отказ = СогласоватьНаСервере();
	КонецЕсли;
	Если не Отказ Тогда
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПравильностьТипаЗаявки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.AUTO_STATUS
		|ИЗ
		|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
		|ГДЕ
		|	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN В(&VIN)";
	МассивВин = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаВИН Цикл
		МассивВин.Добавить(СтрокаТаблицы.ВИН);
	КонецЦикла;
	Запрос.УстановитьПараметр("VIN", МассивВин); 
	ТаблицаСостояния = Запрос.Выполнить().Выгрузить();
	
	Если Объект.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ВозмещениеСкидки
		Или Объект.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ВозмещениеСкидки Тогда
		Для Каждого Строка Из ТаблицаСостояния Цикл
			Если Строка.AUTO_STATUS = "В производстве" 
				Или Строка.AUTO_STATUS = "На складе AFM"
				Или Строка.AUTO_STATUS = "В транспорте до АФМ" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТаблицаСостояния Цикл
			Если Не (Строка.AUTO_STATUS = "В производстве" 
				Или Строка.AUTO_STATUS = "На складе AFM"
				Или Строка.AUTO_STATUS = "В транспорте до АФМ") Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПровериитЗаполнение()
	
	Ошибки = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТАб.Автомобиль
	|ПОМЕСТИТЬ ВТ_Автомобиль
	|ИЗ
	|	&МассивАвтомобилей КАК ТАб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(Renault_КорпоративныеСкидкиСрезПоследних.План) КАК План,
	|	МИНИМУМ(ЕСТЬNULL(Renault_КорпоративныеСкидкиСрезПоследних.Уровень, 0)) КАК Уровень,
	|	ВТ_Автомобиль.Автомобиль.Модель как Модель,
	|	ВТ_Автомобиль.Автомобиль.ВариантКомплектации как Комплектация,
	|	ВТ_Автомобиль.Автомобиль
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Автомобиль КАК ВТ_Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КорпоративныеСкидки.СрезПоследних(&КонецПериода, ) КАК Renault_КорпоративныеСкидкиСрезПоследних
	|		ПО ВТ_Автомобиль.Автомобиль.Модель = Renault_КорпоративныеСкидкиСрезПоследних.Модель
	|			И ВТ_Автомобиль.Автомобиль.ВариантКомплектации = Renault_КорпоративныеСкидкиСрезПоследних.Комплектация
	|ГДЕ
	|	Renault_КорпоративныеСкидкиСрезПоследних.План > &План
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Автомобиль.Автомобиль.Модель,
	|	ВТ_Автомобиль.Автомобиль.ВариантКомплектации,
	|	ВТ_Автомобиль.Автомобиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_КорпоративныеСкидкиСрезПоследних.СкидкаКлиента,
	|	ВТ.Автомобиль
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КорпоративныеСкидки.СрезПоследних(&КонецПериода, ) КАК Renault_КорпоративныеСкидкиСрезПоследних
	|		ПО ВТ.Уровень = Renault_КорпоративныеСкидкиСрезПоследних.Уровень
	|			И ВТ.Модель = Renault_КорпоративныеСкидкиСрезПоследних.Модель
	|			И ВТ.Комплектация = Renault_КорпоративныеСкидкиСрезПоследних.Комплектация";
	Запрос.УстановитьПараметр("МассивАвтомобилей", Объект.ТаблицаВИН.Выгрузить(,"Автомобиль"));
	Запрос.УстановитьПараметр("План",Объект.ТаблицаВИН.Количество());
	Запрос.УстановитьПараметр("КонецПериода", Объект.Дата);
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ из Объект.ТаблицаВИН Цикл
		СтрокаСкидки = Результат.Найти(СтрокаТЧ.Автомобиль,"Автомобиль");
		Если СтрокаСкидки <> Неопределено и СтрокаСкидки.СкидкаКлиента < СтрокаТЧ.ПроцентСкидки Тогда
			СообщениеНользователю = Новый СообщениеПользователю;
			СообщениеНользователю.Поле = "Объект.ТаблицаВИН["+Объект.ТаблицаВИН.Индекс(СтрокаТЧ)+"].ПроцентСкидки";
			СообщениеНользователю.Текст = "Процент скидки на автомобиль "+ СтрокаТЧ.Автомобиль +" превышен";
			СообщениеНользователю.УстановитьДанные(Объект);
			СообщениеНользователю.Сообщить();
			Ошибки = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ошибки;
	
КонецФункции

&НаСервере
Функция СогласоватьНаСервере()
	
	Отказ = Ложь;
	ТаблицаVIN = Объект.ТаблицаВИН.Выгрузить();
	ДокОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.Renault_ЗаявкаНаКорпоративнуюСкидку"));
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияVINВЗаявках.Заявка,
	|	СостоянияVINВЗаявках.VIN
	|ИЗ
	|	РегистрСведений.Renault_СостоянияVINВЗаявках КАК СостоянияVINВЗаявках
	|ГДЕ
	|	СостоянияVINВЗаявках.VIN В(&МассивVIN)
	|	И СостоянияVINВЗаявках.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СостоянияСогласованияКорпСкидок.НаСогласовании)";
	Запрос.УстановитьПараметр("МассивVIN", ТаблицаVIN.ВыгрузитьКолонку("Автомобиль"));
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Для Каждого СтрокаНабора из Результат Цикл
			Сообщить("VIN " + СтрокаНабора.VIN + " на согласовании по заявке №" + СтрокаНабора.Заявка.Номер 
			+ " от:" + СтрокаНабора.Заявка.Дата);
		КонецЦикла;
		Отказ = Истина;
	КонецЕсли;
	Если ДокОбъект.ЭтоНовый () Тогда
		СсылкаНового = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.ПолучитьСсылку();
		ДокОбъект.УстановитьСсылкуНового(СсылкаНового);
	Иначе
		СсылкаНового = ДокОбъект.Ссылка;
	КонецЕсли;
	
	Если не Отказ Тогда
		НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьНаборЗаписей();
		НаборЗаписи.Отбор.Заявка.Установить(СсылкаНового);
		Для Каждого СтрокаТаб из ТаблицаVIN Цикл
			СтрокаНабора = НаборЗаписи.Добавить();
			СтрокаНабора.VIN = СтрокаТаб.Автомобиль;
			СтрокаНабора.Заявка = СсылкаНового;
			Если ОтчетПредоставлен(СтрокаНабора.Заявка, СтрокаНабора.VIN) Тогда
				СтрокаНабора.Статус = ?(СтрокаТаб.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик
										,Перечисления.Renault_СостоянияСогласованияКорпСкидок.ОтчетПредоставлен
										,СтрокаТаб.Статус);
			Иначе
				СтрокаНабора.Статус = ?(СтрокаТаб.Статус= Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик
										,Перечисления.Renault_СостоянияСогласованияКорпСкидок.НаСогласовании
										,СтрокаТаб.Статус);
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписи.Записать();
		
		ДокОбъект.Записать();
		
		ДополнительныеДвиженияДокумента(ДокОбъект.Ссылка);
		
		Узел = ПланыОбмена.Renault_ОчередьЗаявокНаСкидку.ПоличитьУзелОбмена();
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ДокОбъект.Ссылка);
		ЗаписьЖурналаРегистрации(
			"Регистрация изменения заявки на скидку",
			УровеньЖурналаРегистрации.Информация,
			,,
			Строка(ДокОбъект.Ссылка));
	КонецЕсли;
	Возврат Отказ;
	
КонецФункции

&НаСервере
Функция ОтчетПредоставлен(Заявка, VIN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиИФайлы.Объект
		|ИЗ
		|	РегистрСведений.Renault_КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &Объект
		|	И КартинкиИФайлы.Идентификатор = &Идентификатор";
		
	Запрос.УстановитьПараметр("Объект", Заявка);
	Запрос.УстановитьПараметр("Идентификатор", VIN);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ТипОтгрузкиПриИзменении(Элемент)
	
	ТипОтгрузкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипОтгрузкиПриИзмененииНаСервере()
	
	Если Объект.ТипОтгрузки = Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку.Кузовостроители Тогда
		Элементы.Кузовостроитель.Видимость = Истина;
	Иначе
		Элементы.Кузовостроитель.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЛизингПриИзменении(Элемент)
	
	ИспользоватьЛизингПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьЛизингПриИзмененииНаСервере()
	
	Если ИспользоватьЛизинг Тогда
		Элементы.ЛизинговаяКомпания.Видимость = Истина;
	Иначе
		Элементы.ЛизинговаяКомпания.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Если Объект.Ссылка.Пустая() тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Для продолжения ввода необходимо записать документ, 
		|Записать?";
		Ответ = Вопрос(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЭтаФорма.Записать();
		КонецЕсли;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТаблицаВИН.ТекущиеДанные;
	отбор = Новый Структура();
	отбор.Вставить("Объект", Объект.Ссылка);
	отбор.Вставить("Идентификатор", ТекущиеДанные.ВИН);
	ФормаКартинок=РегистрыСведений.Renault_КартинкиИФайлы.ПолучитьФормуСписка(,ЭтаФорма);
	ФормаКартинок.ПараметрОтборПоИзмерению = Отбор;
	ФормаКартинок.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаДобавитьФайл(Команда)
	
	 Если Объект.Ссылка.Пустая() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Для продолжения ввода необходимо записать документ, 
		|Записать?";
		Ответ = Вопрос(Текст, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЭтаФорма.Записать();
		КонецЕсли;
	КонецЕсли;
	
	ФормаКартинок=РегистрыСведений.Renault_КартинкиИФайлы.ПолучитьФормуСписка(,ЭтаФорма);
	отбор = Новый Структура();
	отбор.Вставить("Объект", Объект.Ссылка);
	отбор.Вставить("Идентификатор", "Заявка на корпоративную скидку");
	ФормаКартинок.ПараметрОтборПоИзмерению = Отбор;
	ФормаКартинок.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.Renault_ЗаявкаНаКорпоративнуюСкидку"));  
	Если Не ЗначениеЗаполнено(ДокОбъект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	ЗаполнитьДопРеквизиты(ДокОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопРеквизиты (ДокОбъект)
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст = 
	"ВЫБРАТЬ
	|	КартинкиИФайлы.Идентификатор
	|ИЗ
	|	РегистрСведений.Renault_КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Объект = &Объект
	|	И КартинкиИФайлы.Идентификатор В(&Идентификатор)";
	Запрос.УстановитьПараметр("Объект", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", ДокОбъект.ТаблицаВИН.ВыгрузитьКолонку("ВИН"));
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЗВИН из Объект.ТаблицаВИН Цикл
		СтрокаТЗ = Результат.Найти(СтрокаТЗВИН.ВИН,"Идентификатор");
		Если СтрокаТЗ = Неопределено Тогда
			СтрокаТЗВИН.Файл = 1;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияVINВЗаявках.VIN,
	|	СостоянияVINВЗаявках.Статус
	|ИЗ
	|	РегистрСведений.Renault_СостоянияVINВЗаявках КАК СостоянияVINВЗаявках
	|ГДЕ
	|	СостоянияVINВЗаявках.Заявка = &Заявка";
	Запрос.УстановитьПараметр("Заявка", ДокОбъект.Ссылка);
	Выборка = Запрос.Выполнить();
	Если не Выборка.Пустой() Тогда
		Результат = Выборка.Выбрать(); 
		Пока Результат.Следующий() Цикл
			мСтрокТЗ = Объект.ТаблицаВИН.НайтиСтроки(Новый Структура("Автомобиль", Результат.VIN));
			Если мСтрокТЗ.Количество() > 0 Тогда
				Для Каждого СтрокаТз из мСтрокТЗ Цикл
					СтрокаТз.Статус = Результат.Статус;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого СтрокаТз из Объект.ТаблицаВИН Цикл
		Если не ЗначениеЗаполнено(СтрокаТз.статус) Тогда
			СтрокаТз.Статус = ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.Черновик");
			ЭтаФорма.Доступность = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПерезаполнитьЦеныНаСервере();
		ЗаполнитьСкидкуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция СохранитьНаСервере(НовыйОбъект)
	
	ТаблицаVIN = Объект.ТаблицаВИН.Выгрузить();
	ДокОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.Renault_ЗаявкаНаКорпоративнуюСкидку"));
	Если ДокОбъект.ЭтоНовый () Тогда
		СсылкаНового = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.ПолучитьСсылку();
		ДокОбъект.УстановитьСсылкуНового(СсылкаНового);
	Иначе
		СсылкаНового = ДокОбъект.Ссылка;
	КонецЕсли;
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Заявка.Установить(СсылкаНового);
	Для Каждого СтрокаТаб из ТаблицаVIN Цикл
		СтрокаНабора = НаборЗаписи.Добавить();
		СтрокаНабора.VIN = СтрокаТаб.Автомобиль;
		СтрокаНабора.Заявка = СсылкаНового;
		СтрокаНабора.Статус = ?(СтрокаТаб.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.ПустаяСсылка(),
											Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик,СтрокаТаб.Статус);
	КонецЦикла;
	НаборЗаписи.Записать();
	ДокОбъект.Записать();
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Заявка.Установить(ТекущийОбъект.Ссылка);
	Для Каждого СтрокаТаб из Объект.ТаблицаВИН Цикл
		СтрокаНабора = НаборЗаписи.Добавить();
		СтрокаНабора.VIN = СтрокаТаб.Автомобиль;
		СтрокаНабора.Заявка = ТекущийОбъект.Ссылка;
		СтрокаНабора.Статус = ?(СтрокаТаб.Статус= Перечисления.Renault_СостоянияСогласованияКорпСкидок.ПустаяСсылка(),
											Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик,СтрокаТаб.Статус);
	КонецЦикла;
	НаборЗаписи.Записать();
	ДополнительныеДвиженияДокумента(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДопРеквизиты(ТекущийОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусВРегистре(Автомобиль, Заявка)
	
	МенеджерЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.VIN = Автомобиль;
	МенеджерЗаписи.Заявка = Заявка;
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Статус;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаВИНСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаВИН.ТекущиеДанные;
	Статус = ПолучитьСтатусВРегистре(ТекущаяСтрока.Автомобиль, Объект.Ссылка);
	Элемент.СписокВыбора.Очистить();
	Если Не ЗначениеЗаполнено(Статус) ИЛИ
			Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
		Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.Черновик"));
	ИначеЕсли Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.ДопИнформация Тогда
		Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.НаСогласовании"));
	ИначеЕсли Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
		Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.ОтчетаНеБудет"));
		Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.ОтчетПредоставлен"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкидку(Команда)
	
	ЗаполнитьСкидкуНаСервере ();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСкидкуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таб.Автомобиль
	|ПОМЕСТИТЬ ВТ_Автомобиль
	|ИЗ
	|	&МассивАвтомобилей КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВТ_Автомобиль.Автомобиль) КАК КолПлан,
	|	автомобили.Модель КАК АвтомобильМодель,
	|	автомобили.ВариантКомплектации КАК АвтомобильВариантКомплектации
	|ПОМЕСТИТЬ ВТ_План
	|ИЗ
	|	ВТ_Автомобиль КАК ВТ_Автомобиль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК автомобили
	|		ПО (автомобили.Ссылка = ВТ_Автомобиль.Автомобиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	автомобили.Модель,
	|	автомобили.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_План.КолПлан,
	|	ВТ_План.АвтомобильМодель,
	|	ВТ_План.АвтомобильВариантКомплектации,
	|	МАКСИМУМ(Renault_КорпоративныеСкидки.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Период
	|ИЗ
	|	ВТ_План КАК ВТ_План
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КорпоративныеСкидки КАК Renault_КорпоративныеСкидки
	|		ПО ВТ_План.АвтомобильМодель = Renault_КорпоративныеСкидки.Модель
	|			И ВТ_План.АвтомобильВариантКомплектации = Renault_КорпоративныеСкидки.Комплектация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_План.КолПлан,
	|	ВТ_План.АвтомобильВариантКомплектации,
	|	ВТ_План.АвтомобильМодель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(Renault_КорпоративныеСкидки.Уровень, 0)) КАК Уровень,
	|	автомобили.Модель КАК Модель,
	|	автомобили.ВариантКомплектации КАК Комплектация,
	|	ВТ_Автомобиль.Автомобиль,
	|	ВТ_Период.Период
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_Автомобиль КАК ВТ_Автомобиль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК автомобили
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Период КАК ВТ_Период
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КорпоративныеСкидки КАК Renault_КорпоративныеСкидки
	|				ПО ВТ_Период.АвтомобильМодель = Renault_КорпоративныеСкидки.Модель
	|					И ВТ_Период.АвтомобильВариантКомплектации = Renault_КорпоративныеСкидки.Комплектация
	|					И (Renault_КорпоративныеСкидки.План <= ВТ_Период.КолПлан)
	|					И ВТ_Период.Период = Renault_КорпоративныеСкидки.Период
	|			ПО автомобили.Модель = ВТ_Период.АвтомобильМодель
	|				И автомобили.ВариантКомплектации = ВТ_Период.АвтомобильВариантКомплектации
	|		ПО (автомобили.Ссылка = ВТ_Автомобиль.Автомобиль)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Автомобиль.Автомобиль,
	|	автомобили.Модель,
	|	автомобили.ВариантКомплектации,
	|	ВТ_Период.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_КорпоративныеСкидки.СкидкаКлиента,
	|	ВТ.Автомобиль,
	|	Renault_КорпоративныеСкидки.УчастиеДилера
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КорпоративныеСкидки КАК Renault_КорпоративныеСкидки
	|		ПО ВТ.Уровень = Renault_КорпоративныеСкидки.Уровень
	|			И ВТ.Модель = Renault_КорпоративныеСкидки.Модель
	|			И ВТ.Комплектация = Renault_КорпоративныеСкидки.Комплектация
	|			И ВТ.Период = Renault_КорпоративныеСкидки.Период";
	Запрос.УстановитьПараметр("МассивАвтомобилей", Объект.ТаблицаВИН.Выгрузить(,"Автомобиль"));
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ из Объект.ТаблицаВИН Цикл
		СтрокаСкидки = Результат.Найти(СтрокаТЧ.Автомобиль,"Автомобиль");
		Если СтрокаСкидки <> Неопределено И ЗначениеЗаполнено(СтрокаСкидки.СкидкаКлиента) Тогда
			СтрокаТЧ.ПроцентСкидки = СтрокаСкидки.СкидкаКлиента;
			СтрокаТЧ.МаржаПроцентRenault = 100 - СтрокаСкидки.УчастиеДилера;
		Иначе
			СтрокаТЧ.ПроцентСкидки = 2;
			СтрокаТЧ.МаржаПроцентRenault = 50;
		КонецЕсли;
	КонецЦикла;
	ПересчитатьСкидку("ПроцентСкидки");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВИНПроцентСкидкиПриИзменении(Элемент)
	
	ПересчитатьСкидку("ПроцентСкидки");
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСкидку(ЧтоИзменилось = "")
	
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаВИН Цикл
		Иентификатор = СтрокаТаблицы.ПолучитьИдентификатор();
		ТекущаяСтрока = Объект.ТаблицаВИН.НайтиПоИдентификатору(Иентификатор);
		ДанныеПересчета = Новый Структура;
		ДанныеПересчета.Вставить("ПроцентСкидки", ТекущаяСтрока.ПроцентСкидки);
		ДанныеПересчета.Вставить("СуммаСкидки", ТекущаяСтрока.СуммаСкидки);
		ДанныеПересчета.Вставить("МаржаПроцент", ТекущаяСтрока.МаржаПроцентRenault);
		ДанныеПересчета.Вставить("УчастиеRenault", ТекущаяСтрока.УчастиеRenault);
		ДанныеПересчета.Вставить("ЦенаFlotte", ТекущаяСтрока.ЦенаFlotte);
		ДанныеПересчета.Вставить("ЦенаФактура", ТекущаяСтрока.ЦенаФактура);
		Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.ПересчитатьСкидкуВСтрокеТЗ(ДанныеПересчета, ТекущаяСтрока, ЧтоИзменилось);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	
	ПерезаполнитьЦеныНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныНаСервере ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.ВИН,
	|	Таблица.Автомобиль
	|ПОМЕСТИТЬ ВТ_Автомобилей
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Автомобилей.ВИН КАК ВИН,
	|	ВТ_Автомобилей.Автомобиль,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиАвтомобиля, 0) КАК ЦенаPVC
	|	
	|ИЗ
	|	ВТ_Автомобилей КАК ВТ_Автомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ВТ_Автомобилей.ВИН = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN";
	Запрос.УстановитьПараметр("Таблица", Объект.ТаблицаВИН.Выгрузить());
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЗ из Объект.ТаблицаВИН Цикл
		НайденаяСтрока = Результат.Найти(СтрокаТЗ.ВИН,"ВИН");
		Если НайденаяСтрока <> Неопределено Тогда
			СтрокаТЗ.ЦенаPVC = НайденаяСтрока.ЦенаPVC;
			Если СтрокаТЗ.ПроцентСкидки > 0 Тогда
				СтрокаТЗ.ЦенаFlotte = СтрокаТЗ.ЦенаPVC * (100 - СтрокаТЗ.ПроцентСкидки) / 100;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПересчитатьСкидку("ПроцентСкидки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ЗаписьVIN");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВИНАвтомобильПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаВИН.ТекущиеДанные;
	ТекущаяСтрока.ВИН = ТекущаяСтрока.Автомобиль.VIN;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВИНАвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаВИН.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Статус) 
		И ТекущаяСтрока.Статус <> ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.Черновик") Тогда
			СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВИНПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Статус) 
		И ТекущаяСтрока.Статус <> ПредопределенноеЗначение("Перечисление.Renault_СостоянияСогласованияКорпСкидок.Черновик") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// DMSREN-306
//&НаКлиенте
//Процедура ТаблицаВИНСуммаСкидкиПриИзменении(Элемент)
//	
//	ПересчитатьСкидку("СуммаСкидки");
//	
//КонецПроцедуры

// DMSREN-306
//&НаКлиенте
//Процедура ТаблицаВИНЦенаFlotteПриИзменении(Элемент)
//	
//	ПересчитатьСкидку("ЦенаFlotte");
//	
//КонецПроцедуры

&НаКлиенте
Процедура КлиентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКлиента()
	
	Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
	Форма.Ключ = ПолучитьКонтрагента(Объект.Клиент);
	Форма.Открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрагента(Клиент)
	
	Возврат Клиент.Контрагент;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьОтчетНаСервере(Ссылка)
	
	Возврат Отчеты.Renault_ОтчетПоЗаявкамНаКорпоративнуюСкидку.СформироватьОтчетНаСервере(Ссылка,"СхемаКомпоновкиДляДокумента");
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Результат = СформироватьОтчетНаСервере(Объект.Ссылка);
	Результат.ОтображатьЗаголовки = Ложь;
	Результат.ОтображатьСетку = Ложь;
	Результат.Показать("Отчет по заявке на корп.скидку");
	
КонецПроцедуры

//Производить запись документа в РС "Заявки на корпоративную скидку"
//Параметры 
//ДокументСсылка - ДокументСсылка.Renault_ЗаявкаНаКорпоративнуюСкидку - Ссылка на текущий документ
//
&НаСервереБезКонтекста
Процедура ДополнительныеДвиженияДокумента(ДокументСсылка)
	
	ИсточникДанных = Перечисления.Renault_ИсточникДанныхЗаявкиНаКорпоративнуюСкидку.Дилер;
	CRM_Сервер.ВыполнитьДвиженияДокументаRenault_ЗаявкаНаКорпоративнуюСкидку(ДокументСсылка,ИсточникДанных);
	
КонецПроцедуры

// DMSREN-306
&НаКлиенте
Процедура ТаблицаВИНМаржаПроцентRenaultПриИзменении(Элемент)
	ПересчитатьСкидку("СуммаСкидки");
КонецПроцедуры
